// npm install react-router-dom
import Post from "../components/Post";

function Home() {
  const posts = [
    {
      id: 1,
      title: "Полезные новшества ECMAScript 2026",
      text: "JavaScript получает новый стандарт языка каждый год. Некоторые редакции представляют синтаксис, который меняет то, как программы пишутся или как они выполняются. Версия ECMAScript 2026 (ES17) представила набор полезных возможностей, которые мы рассмотрим в этой статье. Эти возможности добавляют API для задач, которые сейчас решаются с помощью небольших утилит, повторяющихся проверок или обходных путей, подверженных ошибкам.",
      author: "Viktor",
    },
    {
      id: 2,
      title:
        "Это больше не ХИ‑ХИ: как использовать ИИ — и не разучиться думать",
      text: "«Ну понятно, до нормального результата ещё года два». Так можно было сказать про нейронки… примерно полгода назад. И вот мы здесь. ИИ уже делает кучу вещей сильно быстрее и проще. И вот здесь начинается самое дискуссионное. Потому что вместе с рабочей задачей есть риск передать искусственному интеллекту и кое‑что важное: поиск и анализ информации, который влияет на развитие собственного интеллекта. ",
      author: "Viktor",
    },
    {
      id: 3,
      title: "Зря вы не используете эти HTML-элементы",
      text: "Я говорю о семантической вёрстке уже десять лет. Только как-то так получилось, что в последнее время я ничего не писал на эту тему. Надо исправляться!<br> В современных веб-интерфейсах я часто встречаю определённый набор семантических элементов. Это header, main, nav, footer. Даже элемент button встречается. Реже, чем другие, но всё же есть. Не будем на этом останавливаться! Сегодня мы с вами рассмотрим ещё несколько элементов, которые почему-то редко используются. Хотя с ними ваша вёрстка станет ещё более семантичной, а значит, и интерфейсы станут ещё лучше.",
      author: "Viktor",
    },
  ];

  return (
    <section>
      <h1>Главная</h1>
      <div className="feed">
        <h2>Лента</h2>
        {posts.map((post) => (
          <Post
            key={post.id}
            author={post.author}
            title={post.title}
            text={post.text}
            id={post.id}
          />
        ))}
      </div>
    </section>
  );
}

export default Home;
